<details><summary>Digger run report at 2024-02-29 11:55:57 (UTC)</summary>
  <details><summary>Apply for <b>diggerhq/demo-terragrunt-parallel#dev-svc-identity</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "demo-terragrunt-parallel-app-d"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_s3_bucket.example: Creating...
aws_s3_bucket.example: Creation complete after 0s [id=demo-terragrunt-parallel-app-d]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>
</details>